In [2]:
import pandas as pd
import numpy as np

In [5]:
data=pd.DataFrame(np.arange(6).reshape((2,3)),
                 index=pd.Index(['Ohio','Colorado'], name='state'),
                 columns=pd.Index(['one','two','three'],
                                 name='number'))

In [6]:
data

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [11]:
result=data.stack()

In [12]:
result

state     number
Ohio      one       0
          two       1
          three     2
Colorado  one       3
          two       4
          three     5
dtype: int32

In [13]:
result.unstack()

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [14]:
result.unstack(0)

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [15]:
result.unstack('state')

state   Ohio  Colorado
number
one        0         3
two        1         4
three      2         5

In [16]:
result.unstack('number')

number    one  two  three
state
Ohio        0    1      2
Colorado    3    4      5

In [17]:
s1=pd.Series([0,1,2,3],index=['a','b','c','d'])

In [18]:
s2=pd.Series([4,5,6], index=['c','d','e'])

In [19]:
data2=pd.concat([s1,s2], keys=['one','two'])

In [20]:
data2

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [21]:
data2.unstack()

       a    b    c    d    e
one  0.0  1.0  2.0  3.0  NaN
two  NaN  NaN  4.0  5.0  6.0

In [22]:
data2.unstack().stack()

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
two  c    4.0
     d    5.0
     e    6.0
dtype: float64

In [23]:
data2.unstack().stack(dropna=False)

one  a    0.0
     b    1.0
     c    2.0
     d    3.0
     e    NaN
two  a    NaN
     b    NaN
     c    4.0
     d    5.0
     e    6.0
dtype: float64

In [24]:
df=pd.DataFrame({'left':result, 'right':result+5},
               columns=pd.Index(['left','right'], name='side'))

In [25]:
df

side             left  right
state    number
Ohio     one        0      5
         two        1      6
         three      2      7
Colorado one        3      8
         two        4      9
         three      5     10

In [26]:
df.unstack('state')

side   left          right
state  Ohio Colorado  Ohio Colorado
number
one       0        3     5        8
two       1        4     6        9
three     2        5     7       10

In [31]:
df.unstack('state').stack('side')

state         Colorado  Ohio
number side
one    left          3     0
       right         8     5
two    left          4     1
       right         9     6
three  left          5     2
       right        10     7